alexhudici/FreeRTOS-STM32F407-PriorityCeilingProtocol/main.c
	if( ( xSemaphoreHighP != NULL ) && ( xSemaphoreMedP != NULL) )
	{
		// The semaphore was created successfully.
		// The semaphore can now be used.
		printf("\nSems created");
		//xSemaphoreTake( xSemaphoreHighP, portMAX_DELAY );
		//xSemaphoreTake( xSemaphoreMedP, portMAX_DELAY );
		//printf("\nSems can only be given since xSemaphoreCreateBinary was used (not vSemaphoreCreateBinary_");

		ptr[0] = xSemaphoreHighP;
		ptr[1] = xSemaphoreMedP;
		ptr[2] = xPCPsLow;
		ptr[3] = xPCPsHigh1;
		ptr[4] = xPCPsHigh2;

		xTaskCreate( vLowTask, (const signed char*)"LowTask",
			configMINIMAL_STACK_SIZE, ptr, tLOW, NULL );
		xTaskCreate( vMedTask, (const signed char*)"MedTask",
			configMINIMAL_STACK_SIZE, ptr, tMED, NULL );
		xTaskCreate( vHighTask, (const signed char*)"HighTask",
			configMINIMAL_STACK_SIZE, ptr, tHIGH, NULL );



		/* Start the scheduler. */
		vTaskStartScheduler();

		/* If all is well, the scheduler will now be running, and the following line
		will never be reached.  If the following line does execute, then there was
		insufficient FreeRTOS heap memory available for the idle and/or timer tasks
		to be created.  See the memory management section on the FreeRTOS web site
		for more details. */
	}
	else
	{
		printf("\nSemaphore creation failed. Demo terminated.");
	}

	/* Start standard demo/test application flash tasks.  See the comments at
	the top of this file.  The LED flash tasks are always created.  The other
	tasks are only created if mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY is set to
	0 (at the top of this file).  See the comments at the top of this file for
	more information. */
	//vStartLEDFlashTasks( mainFLASH_TASK_PRIORITY );
	
	for( ;; );
}
/*-----------------------------------------------------------*/
//Tasks section

void vLowTask(void *pvParameters)
{
	int i;
	int j = 0;
	SemaphoreHandle_t xSemaphoreMed;
	SemaphoreHandle_t xPCPlow;
	SemaphoreHandle_t xSemaphoreHigh;
	SemaphoreHandle_t xPCPhigh;

	xSemaphoreHigh = xSemaphoreHighP;
	xSemaphoreMed = xSemaphoreMedP;
	xPCPhigh = xPCPsHigh1;
	xPCPlow = xPCPsLow;

	//loop to represent non critical section
	//0x1036640 represents roughly one second of execution time
	for (i = 0; i < 0x1036640; i++){
				j++;
	}

	//acquire PCP lock
	xSemaphoreTakePCP(xPCPlow);
	printf("\nlow takes pcplow");
	xSemaphoreGive(xSemaphoreMed);
	xSemaphoreTakePCP(xPCPhigh);
	printf("\nlow takes pcphigh");
	xSemaphoreGive(xSemaphoreHigh);
	printf("\nlow dropping pcphigh");
	xSemaphoreGivePCP(xPCPhigh);
	printf("\nlow drops pcphigh");
	xSemaphoreGivePCP(xPCPlow);
	printf("\nlow drops pcplow. low exiting");
	vTaskDelete( NULL );


}

void vMedTask(void *pvParameters)
{
//	-block on semaphore
	SemaphoreHandle_t xSemaphoreMed;
	SemaphoreHandle_t xPCP;
	xSemaphoreMed = xSemaphoreMedP;
	xPCP = xPCPsLow;

	xSemaphoreTake(xSemaphoreMed, portMAX_DELAY);
	printf("\nmedium unblocked & start");
//	-try to acquire pcp
	printf("\nmed tries to take lowpcp");
	xSemaphoreTakePCP(xPCP);
	printf("\nmed takes low pcp");
	xSemaphoreGivePCP(xPCP);
	printf("\nmed drops low pcp. medium exiting.");
	vTaskDelete( NULL );
}

void vHighTask(void *pvParameters)
{
	SemaphoreHandle_t xSemaphoreHigh;
	SemaphoreHandle_t xPCP1;
	SemaphoreHandle_t xPCP2;
	xSemaphoreHigh = xSemaphoreHighP;
	xPCP1 = xPCPsHigh2;
	xPCP2 = xPCPsHigh1;

	//block on initial semaphore
	xSemaphoreTake(xSemaphoreHigh, portMAX_DELAY);
	printf("\nhigh unblocked & start");
	//try to acquire pcp
	printf("\nhigh tries to take high pcp");
	xSemaphoreTakePCP(xPCP1);
	printf("\nhigh takes high pcp");
	xSemaphoreGivePCP(xPCP1);
	printf("\nhigh gives high pcp");
	printf("\nhigh tries to take 2nd high pcp");
	xSemaphoreTakePCP(xPCP2);
	printf("\nhigh high takes 2nd high pcp");
	xSemaphoreGivePCP(xPCP2);
	printf("\nhigh gives second high pcp. exiting");
	vTaskDelete( NULL );
}
/*-----------------------------------------------------------*/
//functions section

void loops(void )
{
	
}

/*-----------------------------------------------------------*/
static void prvCheckTimerCallback( TimerHandle_t xTimer )
{
static long lChangedTimerPeriodAlready = pdFALSE;
static unsigned long ulLastRegTest1Value = 0, ulLastRegTest2Value = 0;
long lErrorFound = pdFALSE;

	/* Check all the demo tasks (other than the flash tasks) to ensure
	that they are all still running, and that none have detected an error. */

	if( xAreMathsTaskStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if( xAreIntegerMathsTaskStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if( xAreDynamicPriorityTasksStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if( xAreBlockingQueuesStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if ( xAreBlockTimeTestTasksStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if ( xAreGenericQueueTasksStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if ( xAreRecursiveMutexTasksStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if( xIsCreateTaskStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if( xArePollingQueuesStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	if( xAreSemaphoreTasksStillRunning() != pdTRUE )
	{
		lErrorFound = pdTRUE;
	}

	/* Check that the register test 1 task is still running. */
	if( ulLastRegTest1Value == ulRegTest1LoopCounter )
	{
		lErrorFound = pdTRUE;
	}
	ulLastRegTest1Value = ulRegTest1LoopCounter;

	/* Check that the register test 2 task is still running. */
	if( ulLastRegTest2Value == ulRegTest2LoopCounter )
	{
		lErrorFound = pdTRUE;
	}
	ulLastRegTest2Value = ulRegTest2LoopCounter;

	/* Toggle the check LED to give an indication of the system status.  If
	the LED toggles every mainCHECK_TIMER_PERIOD_MS milliseconds then
	everything is ok.  A faster toggle indicates an error. */
	vParTestToggleLED( mainCHECK_LED );

	/* Have any errors been latch in lErrorFound?  If so, shorten the
	period of the check timer to mainERROR_CHECK_TIMER_PERIOD_MS milliseconds.
	This will result in an increase in the rate at which mainCHECK_LED
	toggles. */
	if( lErrorFound != pdFALSE )
	{
		if( lChangedTimerPeriodAlready == pdFALSE )
		{
			lChangedTimerPeriodAlready = pdTRUE;

			/* This call to xTimerChangePeriod() uses a zero block time.
			Functions called from inside of a timer callback function must
			*never* attempt	to block. */
			xTimerChangePeriod( xTimer, ( mainERROR_CHECK_TIMER_PERIOD_MS ), mainDONT_BLOCK );
		}
	}
}
/*-----------------------------------------------------------*/

